# Pandas

In [0]:
#importing libraries
import pandas as pd
import numpy as np

 **Pandas Have two data structures**

---


 

1.   Series
2.   Dataframes

In [0]:
l =[1,2,3,4,'a']
l

In [0]:
l[0]

In [0]:
l[4]

**Basic operations on pandas dataframes (CRUD) :**

*   Create
*   Read
*   Update
*   Delete

# Pandas Series

# Create

In [0]:
#Direct
s1 = pd.Series([10,20,30,40])
s1

In [0]:
#using numpy array
data = np.array(['a','b','c','d','e','f'])
s2 = pd.Series(data)
s2

In [0]:
#using dictionary
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s3 = pd.Series(data)
s3

In [0]:
#series indexing
data = np.array(['a','b','c','d','e','f'])
s4 = pd.Series(data,index=[1000,1001,1002,1003,1004,1005])
s4

In [0]:
#creating series using scalar value
s5 = pd.Series(7)
s5

In [0]:
#scalar index
s6 = pd.Series(7, index=[0, 1, 2, 3])
s6

# Read update and Delete

In [0]:
#Read by index
s2[1]

In [0]:
#Read using from:until technique
s2[2:4]

In [0]:
#Reading Last two elements
s2[-2:]

In [0]:
#Reading specific indexes
s2[[0,1,4]]

In [0]:
#update the series
s = pd.Series([10,20,30,40])
s

In [0]:
s[2] = 5
s

In [0]:
s[2] = 'L'
s

In [0]:
#Assign vs Copy
sa = s
sa

In [0]:
sc = s.copy()
sc

In [0]:
sc[1] = 420

In [0]:
sc

In [0]:
s

In [0]:
sa

In [0]:
sa[1]=999

In [0]:
sa

In [0]:
s

In [0]:
sc

In [0]:
s[0] = 786

In [0]:
s

In [0]:
sa

In [0]:
sc

In [0]:
#Delete an element
s = pd.Series([10,20,30,40])
s

In [0]:
s.drop(labels=[2])

In [0]:
s

In [0]:
s=s.drop(labels=[2])

In [0]:
s

In [0]:
#Multiple deletion
s = pd.Series([10,20,30,40])
s

In [0]:
s=s.drop(labels=[1,3])

In [0]:
s

In [0]:
#Conditional deletion
import pandas as pd
s = pd.Series([10,20,30,40.10,77,10,65])
s

0    10.0
1    20.0
2    30.0
3    40.1
4    77.0
5    10.0
6    65.0
dtype: float64

In [0]:
s = s[s!=10]

In [0]:
s

1    20.0
2    30.0
3    40.1
4    77.0
6    65.0
dtype: float64

In [0]:
s[5] = 67

In [0]:
s

In [0]:
#sort the index
s.sort_index()

In [0]:
#index is not numerical
s = pd.Series(data = [1,2,3], index = ['A', 'B', 'C'])

In [0]:
s

In [0]:
s = s.reindex(index = ['B','A','C'])
s

# Pandas Dataframe

# Create

1.   Series
2.   List
3.   Dictionary

In [0]:
#Using list
s1 = [1,2,3,4]
s2 = [10, 20, 30, 40, 50]

In [0]:
s1

In [0]:
s2

In [0]:
df = pd.DataFrame([s1,s2])
df

In [0]:
df = pd.DataFrame([s1,s2], index = [67,86], columns = ['a', 'b', 'c', 'd', 'e'])
df

In [0]:
#Using series
s1 = pd.Series([1,2,3,4])
s2 = pd.Series([10, 20, 30, 40, 50])
df = pd.DataFrame([s1,s2])
df

In [0]:
#using dictionary
d = {'PName':['Kohli','Smith', 'Kane', 'Root'], 'Avg': [59.7, 65.2, 55.9, 52.7]}
df = pd.DataFrame(d)
df

In [0]:
df = pd.DataFrame(d,  index = [67,86,74,90], columns = ['PName'])
df

In [0]:
#usin Multiple dictionaries
d1 = {'PName':'Kohli', 'Avg': 59.7}
d2 = {'PName':'Smith', 'Avg': 65.2, 'Country': 'Aus'}
df = pd.DataFrame([d1,d2])
df

In [0]:
#read CSV
#Google colab file upload
from google.colab import files

In [0]:
uploaded = files.upload()

In [0]:
df = pd.read_csv("http://www.sharecsv.com/s/400dea72da1bbc46402527fa88a76635/PlayerStats.csv")
df

# Read and Update

In [0]:
#Create dataframe
d = {'PName':['Kohli','Smith', 'Kane', 'Root'], 'Avg': [59.7, 65.2, 55.9, 52.7],
     'country' : ['Ind', 'Aus', 'Nz', 'Eng'], 
     'StrikeRate' : [92.7, 87.5, 91.1, 90.3] }
df = pd.DataFrame(d)
df

   PName   Avg country  StrikeRate
0  Kohli  59.7     Ind        92.7
1  Smith  65.2     Aus        87.5
2   Kane  55.9      Nz        91.1
3   Root  52.7     Eng        90.3

Slicing dataframe using iloc, loc and expr

In [0]:
#using iloc
df[1]

KeyError: ignored

In [0]:
#All rows slicing
df.iloc[:,0:1]

In [0]:
#All columns slicing
df.iloc[-1,-1]

90.3

In [0]:
df.iloc[0:2,0:2]

   PName   Avg
0  Kohli  59.7
1  Smith  65.2

In [0]:
df.iloc[[0,3],[0,2]]

In [0]:
#Select specic row and column
 
x=df.iloc[1:2,1:2]
x

In [0]:
bonus =x*2
bonus

In [0]:
#using loc
d = {'PName':['Kohli','Smith', 'Kane', 'Root'], 'Avg': [59.7, 65.2, 55.9, 52.7],
     'country' : ['Ind', 'Aus', 'Nz', 'Eng'], 
     'StrikeRate' : [92.7, 87.5, 91.1, 90.3] }
df = pd.DataFrame(d)
df

In [0]:
df.loc[:,['PName']]

In [0]:
# select value by row label and column label using loc
 
df.loc[[1,2],'PName':'country']

In [0]:
df.loc[:,['PName','country']]

In [0]:
Best = pd.Series(['GOAT', 'Test', 'T20', 'Odi'])
df['Achievement'] = Best
df

   PName   Avg country  StrikeRate Achievement
0  Kohli  59.7     Ind        92.7        GOAT
1  Smith  65.2     Aus        87.5        Test
2   Kane  55.9      Nz        91.1         T20
3   Root  52.7     Eng        90.3         Odi

In [0]:
df= df.set_index('Achievement')
df

             PName   Avg country  StrikeRate
Achievement
GOAT         Kohli  59.7     Ind        92.7
Test         Smith  65.2     Aus        87.5
T20           Kane  55.9      Nz        91.1
Odi           Root  52.7     Eng        90.3

In [0]:
#iloc vs loc
df.iloc[1:3,0:2]

In [0]:
df.loc[['GOAT', 'Test'],['PName', 'Avg']]

             PName   Avg
Achievement
GOAT         Kohli  59.7
Test         Smith  65.2

In [0]:
#using regexp
df['Avg' > 55]

TypeError: ignored

In [0]:
df['Avg'] > 55

Dataframe iteration

In [0]:
#create dataframe
#using loc
d = {'PName':['Kohli','Smith', 'Kane', 'Root'], 'Avg': [59.7, 65.2, 55.9, 52.7],
     'country' : ['Ind', 'Aus', 'Nz', 'Eng'], 
     'StrikeRate' : [92.7, 87.5, 91.1, 90.3] }
df = pd.DataFrame(d)
df

(https://ibb.co/bHNHYgf)

In [0]:
# iterating over rows using iterrows() function 
for i, j in df.iterrows():
    print(i, j,"\n")

In [0]:
# iterating over columns
# creating a list of dataframe columns
columns = list(df)
columns

In [0]:
for i in columns: 
    # printing the third element of the column
    print (df[i][3])

Adding a column

In [0]:
#Add a column
d = {'PName':['Kohli','Smith', 'Kane', 'Root'], 'Avg': [59.7, 65.2, 55.9, 52.7]}
df = pd.DataFrame(d)
df

In [0]:
df

In [0]:
#using List
country = ['Ind', 'Aus', 'Nz', 'Eng']

In [0]:
df['Country'] = country
df

In [0]:
#using Series
country = pd.Series(['Ind', 'Aus', 'Nz', 'Eng'])

In [0]:
df['Country'] = country
df

In [0]:
#using dictionary
country = {'Kohli': 'Ind', 'Smith': 'Aus', 'Kane': 'Nz', 'Root':'Eng'}
country

In [0]:
df['Country'] = df['PName'].map(country)
df

In [0]:
#using assign function
df = df.assign(StrikeRate = [92.7, 87.5, 91.1, 90.3])
df

Adding  a row in dataframe

In [0]:
#Add a Row
d = {'PName':['Kohli','Smith', 'Kane', 'Root'], 'Avg': [59.7, 65.2, 55.9, 52.7]}
df = pd.DataFrame(d)
df

   PName   Avg
0  Kohli  59.7
1  Smith  65.2
2   Kane  55.9
3   Root  52.7

In [0]:
df.loc[4] = ['Warner', 49.6]
df

    PName   Avg
0   Kohli  59.7
1   Smith  65.2
2    Kane  55.9
3    Root  52.7
4  Warner  49.6

where(cond,  other =NAN, inplace = True/False)
where condition is true keep the original value, otherwise updat with other
inplace for the dataset changes

In [0]:
d = {'PName':['Kohli','Smith', 'Kane', 'Root', 'Warner'], 'Avg': [59.7, 65.2, 55.9, 52.7, 49.2],
     'country' : ['Ind', 'Aus', 'Nz', 'Eng', 'Aus'], 
     'StrikeRate' : [92.7, 87.5, 91.1, 90.3, 95.8] }
df = pd.DataFrame(d)
df

    PName   Avg country  StrikeRate
0   Kohli  59.7     Ind        92.7
1   Smith  65.2     Aus        87.5
2    Kane  55.9      Nz        91.1
3    Root  52.7     Eng        90.3
4  Warner  49.2     Aus        95.8

In [0]:
df.loc[0:,0:1] = ['Rohit']
df

    PName   Avg country  StrikeRate
0   Rohit  59.7     Ind        92.7
1   Rohit  65.2     Aus        87.5
2    Kane  55.9      Nz        91.1
3    Root  52.7     Eng        90.3
4  Warner  49.2     Aus        95.8

In [0]:
df.where(df['country']=="Aus")

    PName   Avg country  StrikeRate
0     NaN   NaN     NaN         NaN
1   Smith  65.2     Aus        87.5
2     NaN   NaN     NaN         NaN
3     NaN   NaN     NaN         NaN
4  Warner  49.2     Aus        95.8

In [0]:
df

    PName   Avg country  StrikeRate
0   Kohli  59.7     Ind        92.7
1   Smith  65.2     Aus        87.5
2    Kane  55.9      Nz        91.1
3    Root  52.7     Eng        90.3
4  Warner  49.2     Aus        95.8

In [0]:
df.where(df['country']=="Aus", inplace = True)

In [0]:
df

    PName   Avg country  StrikeRate
0     NaN   NaN     NaN         NaN
1   Smith  65.2     Aus        87.5
2     NaN   NaN     NaN         NaN
3     NaN   NaN     NaN         NaN
4  Warner  49.2     Aus        95.8

In [0]:
d = {'Day1':[795, 840, 61500, 870], 'Day2': [831, 65000, 62700, 67300],
     'Day3' : [865, 66700, 64300, 850], 
     'Day4' : [65900, 835, 64950, 890] }
df = pd.DataFrame(d)
df

    Day1   Day2   Day3   Day4
0    795    831    865  65900
1    840  65000  66700    835
2  61500  62700  64300  64950
3    870  67300    850    890

In [0]:
cond = df < 1000
df.where(cond, 0)

   Day1  Day2  Day3  Day4
0   795   831   865     0
1   840     0     0   835
2     0     0     0     0
3   870     0   850   890

In [0]:
#Multiple conditions
d = {'PName':['Kohli','Smith', 'Kane', 'Root', 'Warner'], 'Avg': [59.7, 65.2, 55.9, 52.7, 49.2],
     'country' : ['Ind', 'Aus', 'Nz', 'Eng', 'Aus'], 
     'StrikeRate' : [92.7, 87.5, 91.1, 90.3, 95.8] }
df = pd.DataFrame(d)
df

    PName   Avg country  StrikeRate
0   Kohli  59.7     Ind        92.7
1   Smith  65.2     Aus        87.5
2    Kane  55.9      Nz        91.1
3    Root  52.7     Eng        90.3
4  Warner  49.2     Aus        95.8

In [0]:

cond1 = df['country']== 'Aus'
cond2 = df['Avg']>55
df.where(cond1 & cond2, inplace = True)

In [0]:
df

   PName   Avg country  StrikeRate
0    NaN   NaN     NaN         NaN
1  Smith  65.2     Aus        87.5
2    NaN   NaN     NaN         NaN
3    NaN   NaN     NaN         NaN
4    NaN   NaN     NaN         NaN

query(expr, inplace)
expression to evaluate

In [0]:
d = {'PName':['Kohli','Smith', 'Kane', 'Root', 'Warner'], 'Avg': [59.7, 65.2, 55.9, 52.7, 49.2],
     'country' : ['Ind', 'Aus', 'Nz', 'Eng', 'Aus'], 
     'StrikeRate' : [92.7, 87.5, 91.1, 90.3, 95.8] }
df = pd.DataFrame(d)
df

    PName   Avg country  StrikeRate
0   Kohli  59.7     Ind        92.7
1   Smith  65.2     Aus        87.5
2    Kane  55.9      Nz        91.1
3    Root  52.7     Eng        90.3
4  Warner  49.2     Aus        95.8

In [0]:
df.query('Avg > 55', inplace = True)
df

   PName   Avg country  StrikeRate
0  Kohli  59.7     Ind        92.7
1  Smith  65.2     Aus        87.5
2   Kane  55.9      Nz        91.1

copy(deep=True/False)
True = makes a copy of the data and indices
False = neither the indices nor the data is copied

In [0]:
#create dataframe
d = {'PName':['Kohli','Smith', 'Kane', 'Root', 'Warner'], 'Avg': [59.7, 65.2, 55.9, 52.7, 49.2],
     'country' : ['Ind', 'Aus', 'Nz', 'Eng', 'Aus'], 
     'StrikeRate' : [92.7, 87.5, 91.1, 90.3, 95.8] }
df = pd.DataFrame(d)
df

    PName   Avg country  StrikeRate
0   Kohli  59.7     Ind        92.7
1   Smith  65.2     Aus        87.5
2    Kane  55.9      Nz        91.1
3    Root  52.7     Eng        90.3
4  Warner  49.2     Aus        95.8

In [0]:
df1 = df.copy(deep = True)

In [0]:
df1

    PName   Avg country  StrikeRate
0   Kohli  59.7     Ind        92.7
1   Smith  65.2     Aus        87.5
2    Kane  55.9      Nz        91.1
3    Root  52.7     Eng        90.3
4  Warner  49.2     Aus        95.8

In [0]:
df1.iloc[4,0] = 'Finch'

In [0]:
df1

   PName   Avg country  StrikeRate
0  Kohli  59.7     Ind        92.7
1  Smith  65.2     Aus        87.5
2   Kane  55.9      Nz        91.1
3   Root  52.7     Eng        90.3
4  Finch  49.2     Aus        95.8

In [0]:
df

    PName   Avg country  StrikeRate
0   Kohli  59.7     Ind        92.7
1   Smith  65.2     Aus        87.5
2    Kane  55.9      Nz        91.1
3    Root  52.7     Eng        90.3
4  Warner  49.2     Aus        95.8

In [0]:
df2 = df.copy(deep = False)
df2

    PName   Avg country  StrikeRate
0   Kohli  59.7     Ind        92.7
1   Smith  65.2     Aus        87.5
2    Kane  55.9      Nz        91.1
3    Root  52.7     Eng        90.3
4  Warner  49.2     Aus        95.8

In [0]:
df2.iloc[4,0] = 'Marsh'

In [0]:
df2

   PName   Avg country  StrikeRate
0  Kohli  59.7     Ind        92.7
1  Smith  65.2     Aus        87.5
2   Kane  55.9      Nz        91.1
3   Root  52.7     Eng        90.3
4  Marsh  49.2     Aus        95.8

In [0]:
df

   PName   Avg country  StrikeRate
0  Kohli  59.7     Ind        92.7
1  Smith  65.2     Aus        87.5
2   Kane  55.9      Nz        91.1
3   Root  52.7     Eng        90.3
4  Marsh  49.2     Aus        95.8

In [0]:
df.iloc[4,0] = 'Shaun'

In [0]:
df

   PName   Avg country  StrikeRate
0  Kohli  59.7     Ind        92.7
1  Smith  65.2     Aus        87.5
2   Kane  55.9      Nz        91.1
3   Root  52.7     Eng        90.3
4  Shaun  49.2     Aus        95.8

In [0]:
df2

   PName   Avg country  StrikeRate
0  Kohli  59.7     Ind        92.7
1  Smith  65.2     Aus        87.5
2   Kane  55.9      Nz        91.1
3   Root  52.7     Eng        90.3
4  Shaun  49.2     Aus        95.8

In [0]:
df1

   PName   Avg country  StrikeRate
0  Kohli  59.7     Ind        92.7
1  Smith  65.2     Aus        87.5
2   Kane  55.9      Nz        91.1
3   Root  52.7     Eng        90.3
4  Finch  49.2     Aus        95.8

In [0]:
#create dataframe
d = {'PName':['Kohli','Smith', 'Kane', 'Root', 'Warner'], 'Avg': [59.7, 65.2, 55.9, 52.7, 49.2],
     'country' : ['Ind', 'Aus', 'Nz', 'Eng', 'Aus'], 
     'StrikeRate' : [92.7, 87.5, 91.1, 90.3, 95.8] }
df = pd.DataFrame(d)
df

    PName   Avg country  StrikeRate
0   Kohli  59.7     Ind        92.7
1   Smith  65.2     Aus        87.5
2    Kane  55.9      Nz        91.1
3    Root  52.7     Eng        90.3
4  Warner  49.2     Aus        95.8

In [0]:
df1 = df
df1

    PName   Avg country  StrikeRate
0   Kohli  59.7     Ind        92.7
1   Smith  65.2     Aus        87.5
2    Kane  55.9      Nz        91.1
3    Root  52.7     Eng        90.3
4  Warner  49.2     Aus        95.8

In [0]:
df1.iloc[4,0] = 'Finch'
df1

   PName   Avg country  StrikeRate
0  Kohli  59.7     Ind        92.7
1  Smith  65.2     Aus        87.5
2   Kane  55.9      Nz        91.1
3   Root  52.7     Eng        90.3
4  Finch  49.2     Aus        95.8

In [0]:
df

   PName   Avg country  StrikeRate
0  Kohli  59.7     Ind        92.7
1  Smith  65.2     Aus        87.5
2   Kane  55.9      Nz        91.1
3   Root  52.7     Eng        90.3
4  Finch  49.2     Aus        95.8

apply(func, axis) 
func: python function to apply, axis: row/col wise

In [0]:
#create dataframe
d = {'Apples':[10, 43, 67, 56, 31], 'Oranges': [26,41,12,52,23],
     'Mangos' : [34, 11,52,72,29], 
     'Kiwi' : [22,31,11,59,46] }
df = pd.DataFrame(d)
df

   Apples  Oranges  Mangos  Kiwi
0      10       26      34    22
1      43       41      11    31
2      67       12      52    11
3      56       52      72    59
4      31       23      29    46

In [0]:
df.apply(np.sum, axis = 1)

0     92
1    126
2    142
3    239
4    129
dtype: int64

In [0]:
df['Sum'] = df.apply(np.sum, axis = 1)
df

   Apples  Oranges  Mangos  Kiwi  Sum
0      10       26      34    22   92
1      43       41      11    31  126
2      67       12      52    11  142
3      56       52      72    59  239
4      31       23      29    46  129

In [0]:
df.apply(np.sum, axis = 0)

Apples     207
Oranges    154
Mangos     198
Kiwi       169
Sum        728
dtype: int64

In [0]:
df.loc['Total'] = df.apply(np.sum, axis = 0)

In [0]:
df

       Apples  Oranges  Mangos  Kiwi  Sum
0          10       26      34    22   92
1          43       41      11    31  126
2          67       12      52    11  142
3          56       52      72    59  239
4          31       23      29    46  129
Total     207      154     198   169  728

applymap(func)

In [0]:
#create dataframe
d = {'Apples':[10, 43, 67, 56, 31], 'Oranges': [26,41,12,52,23],
     'Mangoes' : [34, 11,52,72,29], 
     'Kiwi' : [22,31,11,59,46] }
df = pd.DataFrame(d)
df

   Apples  Oranges  Mangoes  Kiwi
0      10       26       34    22
1      43       41       11    31
2      67       12       52    11
3      56       52       72    59
4      31       23       29    46

In [0]:
df.applymap(np.sqrt)

     Apples   Oranges   Mangoes      Kiwi
0  3.162278  5.099020  5.830952  4.690416
1  6.557439  6.403124  3.316625  5.567764
2  8.185353  3.464102  7.211103  3.316625
3  7.483315  7.211103  8.485281  7.681146
4  5.567764  4.795832  5.385165  6.782330

In [0]:
df.applymap(lambda x : x**2)

   Apples  Oranges  Mangoes  Kiwi
0     100      676     1156   484
1    1849     1681      121   961
2    4489      144     2704   121
3    3136     2704     5184  3481
4     961      529      841  2116

In [0]:
def tstFunc(x):
  return x+5

In [0]:
df.applymap(lambda x : tstFunc(x))

   Apples  Oranges  Mangoes  Kiwi
0      15       31       39    27
1      48       46       16    36
2      72       17       57    16
3      61       57       77    64
4      36       28       34    51

aggregate(func, axis)

In [0]:
df.aggregate({'Apples':['sum', 'min', 'max'], 
              'Oranges':['max', 'min'], 
              'Mangoes':['min', 'sum'],  
              'Kiwi':['sum']})

     Apples  Oranges  Mangoes   Kiwi
max      67     52.0      NaN    NaN
min      10     12.0     11.0    NaN
sum     207      NaN    198.0  169.0

groupby(by, axis)

In [0]:
#create dataframe
d = {'PName':['Lara', 'Hayden', 'Bradman', 'Lara', 'Sehwag', 'Kohli', 'Sachin', 'Cook', 'Dravid', 'AB','Smith', 'Kohli', 'Rohit', 'Kane', 'Root', 'Warner', 'Guptil',
              'Mahela', 'Gayle', 'Ponting', 'Miller', 'Inzi', 'Sachin','Dravid', 'Lara', 'Root', 'Kane', 'Tamim', 'Ashraful', 'Kohli'],
     'Runs': [400, 381, 375, 374, 319, 248, 241, 294, 270, 105, 283, 103, 264, 187, 154, 239, 190, 334, 333, 175, 129, 145, 186, 233, 131, 102, 100, 81, 105, 167],
     'country' : ['Wi', 'Aus', 'Aus', 'Wi', 'Ind', 'Ind', 'Ind', 'Eng', 'Ind', 'Sa', 'Aus', 'Ind', 'Ind', 'Nz', 'Eng', 'Aus', 'Nz', 'Sl', 'Wi', 'Aus', 'Sa', 'Pak', 'Ind', 'Ind', 'Wi', 'Eng', 'Nz', 'Ban', 'Ban', 'Ind'],
     'Type': ['Test', 'Test', 'Test', 'Test', 'Test', 'Test', 'Test', 'Test', 'Test', 'Odi', 'Test', 'Odi', 'Odi', 'Test', 'Test', 'Test', 'Test', 'Test', 'Test', 'Test', 'Odi', 'T20', 'Odi', 'Test', 'Test',
             'Odi', 'T20', 'T20','T20', 'T20']
      }
df = pd.DataFrame(d)
df

       PName  Runs country  Type
0       Lara   400      Wi  Test
1     Hayden   381     Aus  Test
2    Bradman   375     Aus  Test
3       Lara   374      Wi  Test
4     Sehwag   319     Ind  Test
5      Kohli   248     Ind  Test
6     Sachin   241     Ind  Test
7       Cook   294     Eng  Test
8     Dravid   270     Ind  Test
9         AB   105      Sa   Odi
10     Smith   283     Aus  Test
11     Kohli   103     Ind   Odi
12     Rohit   264     Ind   Odi
13      Kane   187      Nz  Test
14      Root   154     Eng  Test
15    Warner   239     Aus  Test
16    Guptil   190      Nz  Test
17    Mahela   334      Sl  Test
18     Gayle   333      Wi  Test
19   Ponting   175     Aus  Test
20    Miller   129      Sa   Odi
21      Inzi   145     Pak   T20
22    Sachin   186     Ind   Odi
23    Dravid   233     Ind  Test
24      Lara   131      Wi  Test
25      Root   102     Eng   Odi
26      Kane   100      Nz   T20
27     Tamim    81     Ban   T20
28  Ashraful   105     Ban   T20
29     Kohli   167     Ind   T20

In [0]:
gk = df.groupby('PName')
gk.first()

          Runs country  Type
PName
AB         105      Sa   Odi
Ashraful   105     Ban   T20
Bradman    375     Aus  Test
Cook       294     Eng  Test
Dravid     270     Ind  Test
Gayle      333      Wi  Test
Guptil     190      Nz  Test
Hayden     381     Aus  Test
Inzi       145     Pak   T20
Kane       187      Nz  Test
Kohli      248     Ind  Test
Lara       400      Wi  Test
Mahela     334      Sl  Test
Miller     129      Sa   Odi
Ponting    175     Aus  Test
Rohit      264     Ind   Odi
Root       154     Eng  Test
Sachin     241     Ind  Test
Sehwag     319     Ind  Test
Smith      283     Aus  Test
Tamim       81     Ban   T20
Warner     239     Aus  Test

In [0]:
x = gk.get_group('Kohli') 
x
#x['Runs'].min()

    Runs country  Type
5    248     Ind  Test
11   103     Ind   Odi
29   167     Ind   T20

In [0]:
x['Runs'].min()

103

In [0]:
x.loc[x['Runs'].idxmin()]

Runs       103
country    Ind
Type       Odi
Name: 11, dtype: object

In [0]:
x.loc[x['Runs'].idxmax()]

Runs        248
country     Ind
Type       Test
Name: 5, dtype: object

In [0]:
mg = df.groupby(['country', 'Type'])

In [0]:
x = mg.get_group(('Ind','Test'))
x

     PName  Runs country  Type
4   Sehwag   319     Ind  Test
5    Kohli   248     Ind  Test
6   Sachin   241     Ind  Test
8   Dravid   270     Ind  Test
23  Dravid   233     Ind  Test

Concatenating DataFrame using .concat() :

In [0]:
#Creating dataframe
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 

df = pd.DataFrame(data1)

In [0]:
df

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

In [0]:
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
df1 = pd.DataFrame(data2)

In [0]:
df1

     Name  Age    Address Qualification
0    Abhi   17     Nagpur         Btech
1  Ayushi   14     Kanpur           B.A
2  Dhiraj   12  Allahabad          Bcom
3  Hitesh   52    Kannuaj        B.hons

In [0]:
pd.concat([df,df1])

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
0    Abhi   17     Nagpur         Btech
1  Ayushi   14     Kanpur           B.A
2  Dhiraj   12  Allahabad          Bcom
3  Hitesh   52    Kannuaj        B.hons

In [0]:
con = pd.concat([df,df1], ignore_index =True)
con

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [0]:
con1 = df.append(df1, ignore_index =True)
con1

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

When to concat and when to append

In [0]:
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32],} 
data2 = {'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
df = pd.DataFrame(data1)
df1 = pd.DataFrame(data2)

In [0]:
df

     Name  Age
0     Jai   27
1  Princi   24
2  Gaurav   22
3    Anuj   32

In [0]:
df1

     Address Qualification
0     Nagpur         Btech
1     Kanpur           B.A
2  Allahabad          Bcom
3    Kannuaj        B.hons

In [0]:
con2 = pd.concat([df,df1], axis = 1)
con2

     Name  Age    Address Qualification
0     Jai   27     Nagpur         Btech
1  Princi   24     Kanpur           B.A
2  Gaurav   22  Allahabad          Bcom
3    Anuj   32    Kannuaj        B.hons

Joins:
Inner, Outer, Left Right

In [0]:
#creating dataframe
boy_dict = {'Hobbies': ['Reading', 'Music', 'Cricket', 'Soccer'], 
             'Money_spent': [50, 70, 80 ,100],
              'Time_spent':[2, 1, 4, 4]}
boy_dict

{'Hobbies': ['Reading', 'Music', 'Cricket', 'Soccer'],
 'Money_spent': [50, 70, 80, 100],
 'Time_spent': [2, 1, 4, 4]}

In [0]:
boy = pd.DataFrame(boy_dict)
boy

   Hobbies  Money_spent  Time_spent
0  Reading           50           2
1    Music           70           1
2  Cricket           80           4
3   Soccer          100           4

In [0]:
girl_dict = {'Hobbies': ['Reading', 'Music', 'TvSeries', 'Fashion'], 
             'Money_spent': [20, 90, 10 ,400],
              'Time_spent':[1, 3, 14, 24]}
girl_dict

{'Hobbies': ['Reading', 'Music', 'TvSeries', 'Fashion'],
 'Money_spent': [20, 90, 10, 400],
 'Time_spent': [1, 3, 14, 24]}

In [0]:
girl = pd.DataFrame(girl_dict)
girl

    Hobbies  Money_spent  Time_spent
0   Reading           20           1
1     Music           90           3
2  TvSeries           10          14
3   Fashion          400          24

In [0]:
#Boy is dominating the relationship(Left)
relationship = pd.merge(boy, girl, on='Hobbies', how='left')
relationship

   Hobbies  Money_spent_x  Time_spent_x  Money_spent_y  Time_spent_y
0  Reading             50             2           20.0           1.0
1    Music             70             1           90.0           3.0
2  Cricket             80             4            NaN           NaN
3   Soccer            100             4            NaN           NaN

In [0]:
#Girl is dominating the relationship(Right)
relationship = pd.merge(boy, girl, on='Hobbies', how='right')
relationship

    Hobbies  Money_spent_x  Time_spent_x  Money_spent_y  Time_spent_y
0   Reading           50.0           2.0             20             1
1     Music           70.0           1.0             90             3
2  TvSeries            NaN           NaN             10            14
3   Fashion            NaN           NaN            400            24

In [0]:
#Only doing common things(inner)
relationship = pd.merge(boy, girl, on='Hobbies', how='inner')
relationship

   Hobbies  Money_spent_x  Time_spent_x  Money_spent_y  Time_spent_y
0  Reading             50             2             20             1
1    Music             70             1             90             3

In [0]:
#Mutual respect in the relationship(outer)
relationship = pd.merge(boy, girl, on='Hobbies', how='outer')
relationship

    Hobbies  Money_spent_x  Time_spent_x  Money_spent_y  Time_spent_y
0   Reading           50.0           2.0           20.0           1.0
1     Music           70.0           1.0           90.0           3.0
2   Cricket           80.0           4.0            NaN           NaN
3    Soccer          100.0           4.0            NaN           NaN
4  TvSeries            NaN           NaN           10.0          14.0
5   Fashion            NaN           NaN          400.0          24.0

In [0]:
#Creating dataframe
booking_dict = {'booking_id':[5001, 5002, 5003, 5004, 5005, 5006], 
        'booking_date':['2019-03-03', '2019-03-05', '2019-03-07', '2019-03-11', '2019-05-15', '2019-05-27'], 
        'room_number':[101, 512, 234,119, 234, 101], 
        'guest_id':[1027, 1179, 1106, 1238, 1524, 1786],
         'occupants': [1, 2, 4, 2, 1, 1],
         'room_type':['single', 'double', 'family', 'single', 'single', 'single'], 
        'nights':[7, 4, 2, 3, 1, 1], 
        'arrival_time':['13.00', '10.00', '17.00', '11.00', '19.00', '14.00']} 

booking = pd.DataFrame(booking_dict)

In [0]:
booking

   booking_id booking_date  room_number  ...  room_type  nights arrival_time
0        5001   2019-03-03          101  ...     single       7        13.00
1        5002   2019-03-05          512  ...     double       4        10.00
2        5003   2019-03-07          234  ...     family       2        17.00
3        5004   2019-03-11          119  ...     single       3        11.00
4        5005   2019-05-15          234  ...     single       1        19.00
5        5006   2019-05-27          101  ...     single       1        14.00

[6 rows x 8 columns]

In [0]:
rate_dict = {'room_type':['single', 'single', 'double', 'double', 'family', 'family'], 
        'occupancy':[1, 2, 2, 3, 3, 4], 
        'amount':[50, 70, 100, 120, 150, 180]} 
rate = pd.DataFrame(rate_dict)

In [0]:
rate

  room_type  occupancy  amount
0    single          1      50
1    single          2      70
2    double          2     100
3    double          3     120
4    family          3     150
5    family          4     180

In [0]:
guest_dict ={'guest_id':[1027, 1179, 1106, 1238], 'First_name': ['Vinay', 'Kusum', 'Sharmishtha', 'Ishita'],
            'Last_name':['Kumar', 'Verma', 'Tagor', 'Saxena']}
guest = pd.DataFrame(guest_dict)

In [0]:
guest

   guest_id   First_name Last_name
0      1027        Vinay     Kumar
1      1179        Kusum     Verma
2      1106  Sharmishtha     Tagor
3      1238       Ishita    Saxena

In [0]:
#Give First name Last name of guests
f1 = pd.merge(booking, guest, on='guest_id', how='right')
f1

   booking_id booking_date  room_number  ...  arrival_time   First_name Last_name
0        5001   2019-03-03          101  ...         13.00        Vinay     Kumar
1        5002   2019-03-05          512  ...         10.00        Kusum     Verma
2        5003   2019-03-07          234  ...         17.00  Sharmishtha     Tagor
3        5004   2019-03-11          119  ...         11.00       Ishita    Saxena

[4 rows x 10 columns]

In [0]:
f2 = pd.merge(booking, guest, on='guest_id', how='left')
f2

   booking_id booking_date  room_number  ...  arrival_time   First_name Last_name
0        5001   2019-03-03          101  ...         13.00        Vinay     Kumar
1        5002   2019-03-05          512  ...         10.00        Kusum     Verma
2        5003   2019-03-07          234  ...         17.00  Sharmishtha     Tagor
3        5004   2019-03-11          119  ...         11.00       Ishita    Saxena
4        5005   2019-05-15          234  ...         19.00          NaN       NaN
5        5006   2019-05-27          101  ...         14.00          NaN       NaN

[6 rows x 10 columns]

In [0]:
#Give the booking_date and the number of nights for guest 1238.
booking.query('guest_id == 1238').loc[:,['booking_date', 'nights']]

  booking_date  nights
3   2019-03-11       3

In [0]:
#Give the booking_date and the number of nights for guest 1238.
booking.loc[:,['booking_date', 'nights']].where(booking['guest_id']==1238)

  booking_date  nights
0          NaN     NaN
1          NaN     NaN
2          NaN     NaN
3   2019-03-11     3.0
4          NaN     NaN
5          NaN     NaN

# Delete